# StructuralSectionRoundBar Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionRoundBar Class
Members See Also
---
Defines parameters for Round Bar structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class StructuralSectionRoundBar : StructuralSectionGeneralS
```

Visual Basic
---
```text
Public Class StructuralSectionRoundBar _
	Inherits StructuralSectionGeneralS
```

Visual C++
---
```text
public ref class StructuralSectionRoundBar : public StructuralSectionGeneralS
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRound Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralS Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRoundBar
# See Also
StructuralSectionRoundBar Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace